In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import psycopg2
from config import db_password
from sqlalchemy import create_engine

In [2]:
# Create the connection string using the password from the config.py file
db_string = f"postgres+psycopg2://postgres:{db_password}@127.0.0.1:5432/Car_Dekho_Prediction"

In [3]:
# Create the database engine
engine = create_engine(db_string)

In [4]:
# Connect to PostgreSQL server
dbConnection = engine.connect()

In [5]:
# Read data from PostgreSQL CarDetails database table and load into a DataFrame instance
df_two = pd.read_sql("select * from \"CarDetails\"", dbConnection);
pd.set_option('display.expand_frame_repr', False);

In [6]:
print(df_two);

      index                                 name  year  selling_price  km_driven    fuel seller_type transmission         owner
0         0                        Maruti 800 AC  2007          60000      70000  Petrol  Individual       Manual   First Owner
1         1             Maruti Wagon R LXI Minor  2007         135000      50000  Petrol  Individual       Manual   First Owner
2         2                 Hyundai Verna 1.6 SX  2012         600000     100000  Diesel  Individual       Manual   First Owner
3         3               Datsun RediGO T Option  2017         250000      46000  Petrol  Individual       Manual   First Owner
4         4                Honda Amaze VX i-DTEC  2014         450000     141000  Diesel  Individual       Manual  Second Owner
...     ...                                  ...   ...            ...        ...     ...         ...          ...           ...
4335   4335  Hyundai i20 Magna 1.4 CRDi (Diesel)  2014         409999      80000  Diesel  Individual       Manual  Second Owner
4336   4336           Hyundai i20 Magna 1.4 CRDi  2014         409999      80000  Diesel  Individual       Manual  Second Owner
4337   4337                  Maruti 800 AC BSIII  2009         110000      83000  Petrol  Individual       Manual  Second Owner
4338   4338     Hyundai Creta 1.6 CRDi SX Option  2016         865000      90000  Diesel  Individual       Manual   First Owner
4339   4339                     Renault KWID RXT  2016         225000      40000  Petrol  Individual       Manual   First Owner

[4340 rows x 9 columns]

In [7]:
df_two.dtypes

index             int64
name             object
year              int64
selling_price     int64
km_driven         int64
fuel             object
seller_type      object
transmission     object
owner            object
dtype: object

In [8]:
# Read data from PostgreSQL CarEngineInfo, CarYear, UserInfo database tables and load into a DataFrame instance
df_one = pd.read_sql("select CarEngineInfo.name, CarYear.year, CarEngineInfo.selling_price, CarEngineInfo.km_driven, CarEngineInfo.fuel, UserInfo.seller_type, UserInfo.transmission, UserInfo.owner, CarEngineInfo.mileage, CarEngineInfo.engine, CarEngineInfo.max_power, CarEngineInfo.torque, CarEngineInfo.seats from CarEngineInfo INNER JOIN CarYear ON CarEngineInfo.name = CarYear.name INNER JOIN UserInfo ON UserInfo.name = CarEngineInfo.name", dbConnection);
pd.set_option('display.expand_frame_repr', False);

In [9]:
df_one.dtypes

name             object
year             object
selling_price    object
km_driven        object
fuel             object
seller_type      object
transmission     object
owner            object
mileage          object
engine           object
max_power        object
torque           object
seats            object
dtype: object

In [10]:
def compareCounts(df_one, df_two, colName):
    print(f"df_one {colName} value counts:")
    print(df_one[colName].value_counts())
    print("\n")
    print(f"df_two {colName} value counts: ")
    print(df_two[colName].value_counts())

## Drop unneeded columns

In [11]:
df_one.dtypes

name             object
year             object
selling_price    object
km_driven        object
fuel             object
seller_type      object
transmission     object
owner            object
mileage          object
engine           object
max_power        object
torque           object
seats            object
dtype: object

In [12]:
# Convert some columns in df_one to int64 and float64
df_one["seats"] = df_one["seats"].astype(float)
df_one["year"] = df_one["year"].astype(int)
df_one["selling_price"] = df_one["selling_price"].astype(int)
df_one["km_driven"] = df_one["km_driven"].astype(int)

In [13]:
df_one = df_one.drop(['mileage','engine','max_power','torque','seats'], axis=1)
df_one.dtypes

name             object
year              int64
selling_price     int64
km_driven         int64
fuel             object
seller_type      object
transmission     object
owner            object
dtype: object

In [14]:
df_two = df_two.drop(['index'], axis=1)
df_two.dtypes

name             object
year              int64
selling_price     int64
km_driven         int64
fuel             object
seller_type      object
transmission     object
owner            object
dtype: object

## Fuel Type Cleanup

In [15]:
compareCounts(df_one, df_two, "fuel")

df_one fuel value counts:
Series([], Name: fuel, dtype: int64)


df_two fuel value counts:
Diesel      2153
Petrol      2123
CNG           40
LPG           23
Electric       1
Name: fuel, dtype: int64

In [16]:
df_one["fuel"] = df_one["fuel"].replace({"CNG" : "Other", "LPG" : "Other"})
df_two["fuel"] = df_two["fuel"].replace({"CNG" : "Other", "LPG" : "Other", "Electric" : "Other"})

In [17]:
compareCounts(df_one, df_two, "fuel")

df_one fuel value counts:
Series([], Name: fuel, dtype: int64)


df_two fuel value counts:
Diesel    2153
Petrol    2123
Other       64
Name: fuel, dtype: int64

## Seller Type Cleanup

In [18]:
compareCounts(df_one, df_two, "seller_type")

df_one seller_type value counts:
Series([], Name: seller_type, dtype: int64)


df_two seller_type value counts:
Individual          3244
Dealer               994
Trustmark Dealer     102
Name: seller_type, dtype: int64

## Transmission Cleanup

In [19]:
compareCounts(df_one, df_two, "transmission")

df_one transmission value counts:
Series([], Name: transmission, dtype: int64)


df_two transmission value counts:
Manual       3892
Automatic     448
Name: transmission, dtype: int64

## Owner cleanup

In [20]:
compareCounts(df_one, df_two, "owner")

df_one owner value counts:
Series([], Name: owner, dtype: int64)


df_two owner value counts:
First Owner             2832
Second Owner            1106
Third Owner              304
Fourth & Above Owner      81
Test Drive Car            17
Name: owner, dtype: int64

In [21]:
# Drop records that have "Test Drive Car" as owner
df_one = df_one[~df_one["owner"].isin(['Test Drive Car'])]
df_two = df_two[~df_two["owner"].isin(['Test Drive Car'])]

## Sanity Check Numerical Columns

In [22]:
print(df_one["year"].describe(), "\n")
print(df_two["year"].describe())

count    0.0
mean     NaN
std      NaN
min      NaN
25%      NaN
50%      NaN
75%      NaN
max      NaN
Name: year, dtype: float64

count    4323.000000
mean     2013.065464
std         4.203865
min      1992.000000
25%      2011.000000
50%      2014.000000
75%      2016.000000
max      2020.000000
Name: year, dtype: float64

In [23]:
pd.set_option('display.float_format', lambda x: '%.2f' % x)
print(df_one["selling_price"].describe(), "\n")
print(df_two["selling_price"].describe())

count   0.00
mean     nan
std      nan
min      nan
25%      nan
50%      nan
75%      nan
max      nan
Name: selling_price, dtype: float64

count      4323.00
mean     502357.05
std      578794.36
min       20000.00
25%      202999.00
50%      350000.00
75%      600000.00
max     8900000.00
Name: selling_price, dtype: float64

In [24]:
print(df_one["km_driven"].describe(), "\n")
print(df_two["km_driven"].describe())

count   0.00
mean     nan
std      nan
min      nan
25%      nan
50%      nan
75%      nan
max      nan
Name: km_driven, dtype: float64

count     4323.00
mean     66459.83
std      46570.97
min          1.00
25%      35000.00
50%      60000.00
75%      90000.00
max     806599.00
Name: km_driven, dtype: float64

## Check for NA values

In [25]:
print("Total NA values in df_one: ", df_one.isnull().sum().sum())
print("Total NA values in df_two: ", df_two.isnull().sum().sum())

Total NA values in df_one:  0
Total NA values in df_two:  0

## Combine Prepared Data

In [26]:
master_data = pd.concat([df_one, df_two])
print(master_data.dtypes)
print("Total records: ", master_data["name"].count())
master_data.head()

name             object
year              int64
selling_price     int64
km_driven         int64
fuel             object
seller_type      object
transmission     object
owner            object
dtype: object
Total records:  4323

                       name  year  selling_price  km_driven    fuel seller_type transmission         owner
0             Maruti 800 AC  2007          60000      70000  Petrol  Individual       Manual   First Owner
1  Maruti Wagon R LXI Minor  2007         135000      50000  Petrol  Individual       Manual   First Owner
2      Hyundai Verna 1.6 SX  2012         600000     100000  Diesel  Individual       Manual   First Owner
3    Datsun RediGO T Option  2017         250000      46000  Petrol  Individual       Manual   First Owner
4     Honda Amaze VX i-DTEC  2014         450000     141000  Diesel  Individual       Manual  Second Owner

## Feature Extraction: Manfacturer

In [27]:
# Extract first word from the field to attempt to identify Make of vehicle
import re
pattern = "([^\s]+)"
master_names = master_data["name"].str.extract(pattern)
master_names.value_counts()

Maruti           1280
Hyundai           821
Mahindra          365
Tata              361
Honda             250
Ford              225
Toyota            206
Chevrolet         188
Renault           145
Volkswagen        106
Skoda              68
Nissan             64
Audi               60
BMW                39
Fiat               37
Datsun             37
Mercedes-Benz      35
Mitsubishi          6
Jaguar              6
Land                5
Volvo               4
Ambassador          4
Jeep                3
MG                  2
OpelCorsa           2
Force               1
Isuzu               1
Daewoo              1
Kia                 1
dtype: int64

In [28]:
master_data["manufacturer"] = master_names
master_data.head()

                       name  year  selling_price  km_driven    fuel seller_type transmission         owner manufacturer
0             Maruti 800 AC  2007          60000      70000  Petrol  Individual       Manual   First Owner       Maruti
1  Maruti Wagon R LXI Minor  2007         135000      50000  Petrol  Individual       Manual   First Owner       Maruti
2      Hyundai Verna 1.6 SX  2012         600000     100000  Diesel  Individual       Manual   First Owner      Hyundai
3    Datsun RediGO T Option  2017         250000      46000  Petrol  Individual       Manual   First Owner       Datsun
4     Honda Amaze VX i-DTEC  2014         450000     141000  Diesel  Individual       Manual  Second Owner        Honda

In [29]:
# Bin manufacturers with less than 20 records in the data as "Other"
low_count_makes = master_names.value_counts()[master_names.value_counts() < 20].index.to_flat_index().to_list()
# Above gives a list of tuples, which will need to be converted to a plain list for use in editing binned records
low_count_makes = [item for i in low_count_makes for item in i]
low_count_makes

['Mitsubishi',
 'Jaguar',
 'Land',
 'Volvo',
 'Ambassador',
 'Jeep',
 'MG',
 'OpelCorsa',
 'Force',
 'Isuzu',
 'Daewoo',
 'Kia']

In [30]:
master_data["manufacturer"][master_data["manufacturer"].isin(low_count_makes)] = "Other"
master_data["manufacturer"].value_counts()

/Users/bradleycao/opt/anaconda3/envs/mlenv/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

Maruti           1280
Hyundai           821
Mahindra          365
Tata              361
Honda             250
Ford              225
Toyota            206
Chevrolet         188
Renault           145
Volkswagen        106
Skoda              68
Nissan             64
Audi               60
BMW                39
Fiat               37
Datsun             37
Other              36
Mercedes-Benz      35
Name: manufacturer, dtype: int64

## Save Output

In [ ]:
master_data.to_csv("Resources/master_data.csv")

In [31]:
# Close the database connection
dbConnection.close();